### EXPLORE PANDAS AGGREGATE FUNCTIONS

Here are the 13 aggregating functions available in Pandas and quick summary of what it does.

- mean(): Compute mean of groups
- sum(): Compute sum of group values
- size(): Compute group sizes
- count(): Compute count of group
- std(): Standard deviation of groups
- var(): Compute variance of groups
- sem(): Standard error of the mean of groups
- describe(): Generates descriptive statistics
- first(): Compute first of group values
- last(): Compute last of group values
- nth() : Take nth value, or a subset if n is a list
- min(): Compute min of group values
- max(): Compute max of group values

In [1]:
# IMPORT LIBRARIES
import pandas as pd

In [2]:
# IMPORT DATA SET
ins_data=pd.read_csv(r"C:\Users\PRIYANKA\Data_Science_14_april_jhon\data_Sets\insurance.csv")
ins_data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [3]:
#FINDING MEAN
print("MEAN OF AGE:",ins_data['age'].mean())
print("=========================================================")
print("MEAN OF CHILDREN:", ins_data['children'].mean())
print("=========================================================")
print("MEAN OF CHARGES:",ins_data['charges'].mean())
print("=========================================================")
ins_data.groupby('region').mean()

MEAN OF AGE: 39.20702541106129
=========================================================
MEAN OF CHILDREN: 1.0949177877429
=========================================================
MEAN OF CHARGES: 13270.422265141257
=========================================================

                 age        bmi  children       charges
region
northeast  39.268519  29.173503  1.046296  13406.384516
northwest  39.196923  29.199785  1.147692  12417.575374
southeast  38.939560  33.355989  1.049451  14735.411438
southwest  39.455385  30.596615  1.141538  12346.937377

In [4]:
# FINDING SUM
print("TOTAL SUM OF CHARGES :",ins_data['charges'].sum())
print("=========================================================")
ins_data.groupby('sex').sum()

TOTAL SUM OF CHARGES : 17755824.990759
=========================================================

          age        bmi  children       charges
sex
female  26151  20110.070       711  8.321061e+06
male    26308  20917.555       754  9.434764e+06

In [5]:
# FINDING SIZE
print(ins_data.groupby('region').size())
print("==================================================")
print(ins_data.groupby('sex').size())

region
northeast    324
northwest    325
southeast    364
southwest    325
dtype: int64
==================================================
sex
female    662
male      676
dtype: int64

In [6]:
# finding count
print(ins_data.groupby('children').count())
print("==============================================")
print("based on size of children : \n",ins_data['children'].value_counts())
print("===================================================")
print("based on region:\n ",ins_data['region'].value_counts())

          age  sex  bmi  smoker  region  charges
children
0         574  574  574     574     574      574
1         324  324  324     324     324      324
2         240  240  240     240     240      240
3         157  157  157     157     157      157
4          25   25   25      25      25       25
5          18   18   18      18      18       18
==============================================
based on size of children :
 0    574
1    324
2    240
3    157
4     25
5     18
Name: children, dtype: int64
===================================================
based on region:
  southeast    364
southwest    325
northwest    325
northeast    324
Name: region, dtype: int64

In [7]:
# using describe
ins_data.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [8]:
# USING STD
print(ins_data.groupby('children').std())
print("====================================")
print(ins_data['age'].std())
print(ins_data['charges'].std())
print(ins_data['bmi'].std())

                age       bmi       charges
children
0         16.436228  6.039106  12023.293942
1         12.067445  6.101435  11823.631451
2         11.588715  6.509644  12891.368347
3         12.206174  5.787173  12330.869484
4         12.138094  4.627211   9139.223321
5         10.123583  7.139686   3808.435525
====================================
14.049960379216172
12110.011236693994
6.098186911679017

In [9]:
#USING VARIANCE
print(ins_data['age'].var())
print(ins_data['charges'].var())
print(ins_data['bmi'].var())

197.40138665754424
146652372.1528548
37.187883609773266

In [10]:
# USING MIN
print("MIN AGE IS:",ins_data['age'].min())
print("MIN NO OF CHIDREN ARE:",ins_data['children'].min())
print("MIN BMI IS:",ins_data['bmi'].min())
print("MIN CHARGE AMOUNT IS:",ins_data['charges'].min())

MIN AGE IS: 18
MIN NO OF CHIDREN ARE: 0
MIN BMI IS: 15.96
MIN CHARGE AMOUNT IS: 1121.8739

In [11]:
# USING MAX
print("MAX AGE IS:",ins_data['age'].max())
print("MAX NO OF CHIDREN ARE:",ins_data['children'].max())
print("MAX BMI IS:",ins_data['bmi'].max())
print("MAX CHARGE AMOUNT IS:",ins_data['charges'].max())

MAX AGE IS: 64
MAX NO OF CHIDREN ARE: 5
MAX BMI IS: 53.13
MAX CHARGE AMOUNT IS: 63770.42801